Nepali-journals-conferences/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Journals and Conferences in Nepal | Science innovation Nepal</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://abhinavNepal.github.io/Science-innovation-Nepal/Nepali-journals-conferences/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Abhinav Nepal">
<meta property="og:site_name" content="Science innovation Nepal">
<meta property="og:title" content="Journals and Conferences in Nepal">
<meta property="og:url" content="https://abhinavNepal.github.io/Science-innovation-Nepal/Nepali-journals-conferences/">
<meta property="og:description" content="For the list of journals, it seems that there is already a database here.
So, we are not collecting the database right now, but we need to properly read what exactly Nepal Journals Online do.
We stron">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-04-17T12:41:18+01:00">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="https://abhinavNepal.github.io/Science-innovation-Nepal/">

            <span id="blog-title">Science innovation Nepal</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="https://www.abhinavnepal.com/" class="nav-link">Scholars</a>
                </li>
<li class="nav-item">
<a href="../Nepali-research-institutions/" class="nav-link">Research Institutes</a>
                </li>
<li class="nav-item">
<a href="../Nepali-innovation-industry/" class="nav-link">Innovation Industry</a>
                </li>
<li class="nav-item active">
<a href="." class="nav-link">Journals and Conferences <span class="sr-only">(active)</span></a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Journals and Conferences in Nepal</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
For the list of journals, it seems that there is already a database <a href="http://www.nepjol.info/index.php/index">here</a>.
So, we are not collecting the database right now, but we need to properly read what exactly Nepal Journals Online do.
We strongly believe in open science and that all research works must be made openly available.
</p>

<p>
Also, we are interested in finding out some scientific way of ranking the journals.
The objective is to provide incentives to the journals to maintain quality.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Upcoming Conferences</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">International</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Mountains in the changing world (<a href="http://conference.kias.org.np/">MOCHWO 2018</a>)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">National</h3>
</div>
</div>
    </div>
    

</article><!--End of body content--><footer id="footer">
            Contents © 2019         <a href="mailto:bisheshkh@gmail.com">Abhinav Nepal</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


        <script src="../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates --><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
